headers: list = ['b-метил-D-глюкозид',
                 'D-галактоновая кислота г-лактон',
                 'L-аргинин',
                 'метиловый эфир пировиноградной кислоты',
                 'D-ксилоза',
                 'D-галактуроновая кислота',
                 'L-аспарагин',
                 'Твин 40',
                 'i-эритритол',
                 '2-гидроксибензойная кислота',
                 'L-фенилаланин',
                 'Твин 80',
                 'D-маннитол',
                 '4-гидроксибензойная кислота',
                 'L-серин',
                 'a-циклодекстрин',
                 'N-ацетил-D-глюкозамин',
                 'g-гидроксимасляная кислота',
                 'L-треонин',
                 'гликоген',
                 'D-глюкозаминовая кислота',
                 'итаконовая кислота',
                 'глицил-L-глутаминовая кислота',
                 'D-целлобиоз',
                 'глюкоза-1-фосфат',
                 'a-кетомасляная кислота',
                 'фенилэтиламин',
                 'a-D-лактоза',
                 'D,L-a-глицерол фосфат',
                 'D-яблочная кислота',
                 'путресцин']

headers_res: list = ['SWCD', 'аминогруппа', 'фенольные', 'полимеры', 'аминокислоты', 'карбон.к-ты', 'углеводы']
indexes: list = ['ACWD', 'Индекс Шеннона']

amino_group: tuple = ('путресцин', 'фенилэтиламин')
amino_acids: tuple = ('глицил-L-глутаминовая кислота', 'L-треонин', 'L-серин',
                      'L-фенилаланин', 'L-аспарагин', 'L-аргинин')
polymers: tuple = ('гликоген', 'a-циклодекстрин', 'Твин 80', 'Твин 40')
phenolic: tuple = ('2-гидроксибензойная кислота', '4-гидроксибензойная кислота')
carbonic_acids: tuple = ('метиловый эфир пировиноградной кислоты', 'D-глюкозаминовая кислота',
                         'D-галактуроновая кислота', 'g-гидроксимасляная кислота', 'итаконовая кислота',
                         'a-кетомасляная кислота', 'D-яблочная кислота')
carbohydrates: tuple = ('D-целлобиоз', 'a-D-лактоза', 'b-метил-D-глюкозид', 'D-ксилоза', 'i-эритритол',
                        'D-маннитол', 'N-ацетил-D-глюкозамин', 'глюкоза-1-фосфат', 'D,L-a-глицерол фосфат',
                        'D-галактоновая кислота г-лактон')
